#language:ru
@mosweather
Функционал: Мосэкомониторинг

  Сценарий: Оценка качества воздуха

    * шаг № "1"
    * открыть url "https://mosecom.mos.ru/"
    * инициализация страницы "MosecomMos"
    * проскроллить страницу до текста "Пройти опрос о качестве воздуха в Москве"
    * шаг № "2"
    * ввести в поле "адрес" значение "Автозаводская"
    * кликнуть на элемент "первый из списка адресов"
    * кликнуть на элемент "Кнопка Ответить"
    * шаг № "3"
    * опрос на стадии 2
    * выбрать пункт "Газ" опроса на стадии "Выберите характер запаха из списка"
    * кликнуть на элемент "Кнопка Ответить"
    * шаг № "4"
    * опрос на стадии 3
    * кликнуть на элемент "выбор даты"
    * кликнуть на элемент "первая дата из списка"
    * кликнуть на элемент "выбор временного отрезка"
    * выбрать временной отрезок '00:00 - 06:00'
    * кликнуть на элемент "Кнопка Ответить"
    * шаг № "5"
    * опрос на стадии 4
    * выбрать пункт "Единовременно" опроса на стадии "Выберите периодичность появления запахов"
    * кликнуть на элемент "Кнопка Ответить"
    * шаг № "6"
    * опрос на стадии 5




