#language:ru
@mosweather
Функционал: Поиск гугл

  Сценарий: Оценка качества воздуха

    * шаг № "1"
    * открыть url "https://mosecom.mos.ru/"
    * инициализация страницы "MosecomMos"
    * на странице присутствует текст "Пройти опрос о качестве воздуха в Москве"
    * шаг № "2"
    * ввести в поле "поле адреса" значение "Автозаводская"
    * кликнуть на элемент "первый из списка адресов"
    * кликнуть на элемент "Кнопка Ответить"
    * шаг № "3"
    * проверка что опрос на стадии 2
    * выбрать пункт "Газ"

